{
   "title": "Representation Grant (this should not appear)",
   "pages": [    
    {
     "name": "creditorsPage",
     "elements": [
      {
       "type": "yesno",
       "name": "question386",
       "title": "Did {deceasedName} owe more than $10,000 to any one person/organization?"
      },
      {
       "type": "paneldynamic",
       "name": "question300",
       "templateElements": [
        {
         "type": "text",
         "name": "question387",
         "title": "Name"
        },
        {
         "type": "yesno",
         "name": "question389",
         "title": "individual or not <br>[JIRA] only ask this question for executors and beneficiaries"
        },
        {
         "type": "infotext",
         "name": "question390",
         "title": "individual? alive? adult? competent? dead? died after 4 days?\n<br><br>\norganization - name of contact optional, telling them they need the right address. (possibly show this in the P1 page) right address for notice",
         "titleLocation": "hidden"
        }
       ]
      },
      {
       "type": "infotext",
       "name": "question388",
       "title": "do we need to ask about how much they are owed here? so we avoid asking later? NO Jun 4 2020",
       "titleLocation": "hidden",
       "messageStyle": "error"
      }
     ],
     "title": "creditors for AWOW (do not show for GP or AWW)"
    },
    {
     "name": "finalizeAssetsPage",
     "elements": [
      {
       "type": "panel",
       "name": "panel1",
       "elements": [
        {
         "type": "matrixdropdown",
         "name": "finalizeAssetPlaceholder",
         "title": "What is the value for the following items on the date of {deceasedName}'s death?",
         "columns": [
          {
           "name": "Column 1",
           "title": "Value",
           "cellType": "text"
          }
         ],
         "choices": [
          1,
          2,
          3,
          4,
          5
         ],
         "rows": [
          {
           "value": "Row 1",
           "text": "1969 Ford Mustang"
          }
         ]
        }
       ]
      },
      {
       "type": "text",
       "name": "question429",
       "title": "P9 swearing date? Option to leave completely/partially blank so the applicant can swear the P9 at the courthouse."
      },
      {
       "type": "infotext",
       "name": "question435",
       "title": "    * [TYLER] fees if they want additional court certified copies of the estate grant - but this might not be an issue because they accepted copies rather than originals",
       "titleLocation": "hidden"
      },
      {
       "type": "infotext",
       "name": "question453",
       "title": "If you have not been able to obtain the exact amounts for certain assets or liabilities, you will first need to get an Authorization to Obtain Estate Information (P18). Some parties will accept a photocopy of this document while others may required certified copies. Each certified copy costs $40. Similarly, certified copies of the Estate Grant (P19) cost $40 each and may be required by some asset holders when transferring the assets over to you, the personal representative.",
       "titleLocation": "hidden"
      },
      {
       "type": "infotext",
       "name": "question443",
       "title": "Nov 24 2020 - Rush applications can be done by just a letter. (from Dani and Kristen). This is easy to enable. However, question going forward for DDRs is protocol for reading and/or responding to these letters. Can we allow SRLs to write the letters and say there is no guarantee nor a response expected; they just get what they get due to volume.",
       "titleLocation": "hidden"
      },
      {
       "type": "text",
       "name": "question436",
       "title": "How many certified copies of the Representation Grant do you need?",
       "description": "$40 each so call ahead to see if they will accept a photo copy instead of a certified court copy."
      }
     ],
     "title": "Finalize Asset Values"
    }
   ],
   "showQuestionNumbers": "off",
   "requiredText": ""
  }