{
   "pages": [
      {
         "name": "p1EarlyPage",
         "elements": [            
            {
               "type": "panel",
               "name": "panel22",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "elements": [
                  {
                     "type": "infotext",
                     "name": "PrintP1",
                     "title": "This is the first review and print page to print the P1 form (to notify successors).\n<br>\n<br>\n It will generated a PDF that the applicant would download.\n<br>\n<br>\nIt will give instructions on how to notify the successors.\n<br>\n<br>\nIf any changes are made in the prior questions, need to inform applicants they may need to re-notify.",
                     "titleLocation": "hidden",
                     "messageStyle": "inline"
                  },
                  {
                     "type": "helptext",
                     "name": "question414",
                     "title": "How do I open a PDF? Where does it save to?",
                     "titleLocation": "hidden"
                  },
                  {
                     "type": "infotext",
                     "name": "question405",
                     "title": "You're ready to deliver the P1 to people. Define served. \n<br>\nYou will only be able to file your documents 21 days after the last person was deemed to have been served. \n<br>\nThese are the ways you can deliver a notice. Choose the best way you see fit to notify each different person.\n<br>\n•  In person (printer required)\n<br>\n•  Electronically (e-mail, fax, or other electronic means)\n•  By mail (printer required)\n<br>\n\nHere is a sample message that you can copy and paste to email people. include, ask a receipt as simply as \"thanks\" \"I have received your email\".\n\nWe will provide a list of people you need to notify.",
                     "isRequired": true,
                     "titleLocation": "hidden"
                  },
                  {
                     "type": "infotext",
                     "name": "question391",
                     "title": "[JIRA] auto-send email function? or email from this service?",
                     "titleLocation": "hidden",
                     "visible": false
                  }
               ]
            },
            {
               "type": "infotext",
               "name": "question416",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Below is a list of people is who you need to notify and give a fair chance to disagree with your application. You may choose to notify more people than those on this list. If you do, you do not need to keep track of them. ",
               "titleLocation": "hidden"
            },
            {
               "type": "matrixdynamic",
               "name": "question408",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "How did {recipient} receive notice? [for children or mentally incapable people Shawn Johnson (in the care of Taylor Johnson)]\n",
               "columns": [
                  {
                     "name": "Column 1",
                     "title": "Method",
                     "cellType": "radiogroup",
                     "choices": [
                        {
                           "value": "item1",
                           "text": "In person"
                        },
                        {
                           "value": "item2",
                           "text": "Mail"
                        },
                        {
                           "value": "item3",
                           "text": "Electronically"
                        }
                     ]
                  },
                  {
                     "name": "Column 2",
                     "title": "Person who served Column 1",
                     "cellType": "radiogroup",
                     "hasOther": true,
                     "choices": [
                        {
                           "value": "item1",
                           "text": "applicant1"
                        },
                        {
                           "value": "item2",
                           "text": "applicant2"
                        },
                        {
                           "value": "item3",
                           "text": "applicant3"
                        }
                     ],
                     "otherText": "Name of person who served"
                  },
                  {
                     "name": "Column 3",
                     "title": "Date Served",
                     "cellType": "text",
                     "inputType": "date"
                  }
               ],
               "choices": [
                  1,
                  2,
                  3,
                  4,
                  5
               ],
               "rowCount": 1
            },
            {
               "type": "text",
               "name": "p1EarlyServerName",
               "title": "Server Name",
               "visible": false,
               "visibleIf": "{noticeRequired}"
            },
            {
               "type": "text",
               "name": "p1EarlyDelivererOccupation",
               "title": "Server Occupation",
               "visible": false,
               "visibleIf": "{noticeRequired}"
            },
            {
               "type": "address",
               "name": "p1EarlyDelievererOrdinaryAddress",
               "title": "Server Ordinary Address",
               "description": "city, prov, country only",
               "visible": false,
               "visibleIf": "{noticeRequired}"
            },
            {
               "type": "infotext",
               "name": "question409",
               "title": "Taylor Johnson sent a response acknowledging the receipt of the notice\n<br><br>\nWhen delivering a notice electronically, you must receive a response from the recipient before it is considered delivered.\n<br><br>\nIf you haven't received a response, do a follow up first and fill in the date after you receive a confirmation of your electronic delivery.\n<br><br>\nYou will retain a copy of the response and provide them when requested by the registrar\n<br>\n[JIRA] How best to warn applicant waiting for electronic confirmation? \nShould applicants move to the next page, this page would be incomplete. How are we checking for completeness?",
               "titleLocation": "hidden",
               "visible": false,
               "visibleIf": "{noticeRequired}"
            },
            {
               "type": "helptext",
               "name": "question406",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "What if I don't get a written response when sending a notice electronically?",
               "titleLocation": "hidden",
               "body": "Because it is easy for people to change their contact information (such as their e-mail address of fax number), a written response is required to ensure you were able to successfully deliver your notice.\n\n\n\nIf you don't receive a response, you will have to resend the documents by mail or deliver the document to them in person."
            },
            {
               "type": "helptext",
               "name": "question399",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Why does the Public Guardian and Trustee (PGT) get a notice?",
               "titleLocation": "hidden",
               "body": "You are required by law to notify the Public Guardian and Trustee (PGT) when a child under the age of 19 or an adult who is not mentally competent receives a gift from {deceasedName}'s estate. The PGT is there protect their interests."
            },
            {
               "type": "infotext",
               "name": "question401",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Things to Include with Notice to Public Guardian and Trustee (PGT)\n<br><br>\n-P1<br>\n-Letter app generates<br>\n$315 in certified cheque or bank draft payable to \"Public Guardian and Trustee\"",
               "titleLocation": "hidden"
            },
            {
               "type": "infotext",
               "name": "question456",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "[Old Spreadsheet Notes copied here Nov 12 2020]\n<br>\nGiving notification to the Public Guardian and Trustee (PGT)\n\nPart of the process in getting a representation grant requires you to notify specific people that you are applying. If those people are under 19 years of age, or they are not mentally competent, you will also need to notify the Public Guardian and Trustee (PGT). The PGT charges a fee for their services. The required fees are detailed in their list of fees (section for Wills, Estates and Succession Act, item (d)). \nhttp://www.trustee.bc.ca/fees/Documents/PGT%20Fee%20Schedule.pdf",
               "titleLocation": "hidden"
            },
            {
               "type": "infotext",
               "name": "question400",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "[JIRA] Autogenerate letter to PGT including:\n<br>\nFor the minor or mentally incompetent person\n<br>\n•  Full name<br>\n•  Date of birth<br>\n•  Address of where they live\n<br><br>\nFor the parent/ guardian of the minor or committee of the mentally incompetent person\n<br>\n•  Full name<br>\n•  Address of where they live if they don't live with the minor/ mentally incompetent personThings to Include with Notice to Public Guardian and Trustee (PGT)",
               "titleLocation": "hidden"
            },
            {
               "type": "infotext",
               "name": "question403",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "[JIRA] Parse address of child or mentally incapable person. If outside of BC, they need to serve another PGT or equivalent",
               "titleLocation": "hidden"
            },
            {
               "type": "text",
               "name": "question427",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Name other PGT equivalent outside of BC. + regular service options.",
               "description": "You are responsible for knowing the requirements to serve them, including additoinal info they need and to pay the filing fee. (there may not be a filing fee)."
            },
            {
               "type": "yesno",
               "name": "question207",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Did you get a written response from PGT?"
            },
            {
               "type": "infotext",
               "name": "question430",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Make sure you provide a copy to the court. We'll remind you later. [In the future. Scan and upload?]",
               "titleLocation": "hidden"
            },
            {
               "type": "helptext",
               "name": "question407",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "How is the 21 days calculated?",
               "titleLocation": "hidden",
               "body": "Depending on how you delivered the notice, it is considered delivered\n<br>\n• on the date you gave the notice directly in person\n<br>\n• on the date you mailed the notice\n<br>\n• on the date you sent the notice electronically (if you receive a response)"
            },
            {
               "type": "infotext",
               "name": "question404",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "[JIRA] Generate P9 for each person who served a P1.",
               "titleLocation": "hidden"
            },
            {
               "type": "text",
               "name": "question422",
               "visible": false,
               "visibleIf": "{noticeRequired}",
               "title": "Date the P9 was sworn by {applicantX}. occupation and address for non-applicant left blank to be filled by hand.[JIRA ability to put this off until later - applicant(s) can leave blank to swear everything at the courthouse]",
               "inputType": "date"
            },
            {
               "type": "infotext",
               "name": "question410",
               "visible": false,
               "title": "[JIRA] Calendar/Countdown based on date of service and method of service. Tells you know when you can file.\n<br><br>\nWaiting 21 Days      After the Last Notice is Delivered\n\nYou must wait 21 days after delivering the last notice before you can submit your paperwork to the courts. This is to give time to the other side to receive the notice and to raise any concerns. ",
               "titleLocation": "hidden"
            },
            {
               "type": "infotext",
               "name": "question455",
               "visible": false,
               "title": "Special Circumstances for rushed grant. Jack asked Kristen and Dani Nov 12 2020 for frequency. Explore necessity for a rush option and look at the pre-requisites for a petition (Form 66).",
               "titleLocation": "hidden"
            },
            {
               "type": "infotext",
               "name": "question458",
               "visible": false,
               "title": "[Old spreadsheet notes moved here Nov 12 2020]\n<br>\nMight be not useful. The original idea was that this was one of the 3 \"buckets of information\" involved in Rep Grants. Delete if not useful.\n<br><br>\nInformation about the deceased's assets and debts. For example:\nThe latest bank account and credit card statements\nInformation about land, including houses, apartments or condos\nVehicle registration\nAnyone else the deceased owed money to\nhttps://www2.gov.bc.ca/assets/gov/health/forms/vital-statistics/vsa532_fill.pdf",
               "titleLocation": "hidden"
            },
            {
               "type": "helptext",
               "name": "question402",
               "visible": false,
               "title": "I got a Notice of Dispute after I delivered my notice.\n\n",
               "titleLocation": "hidden",
               "body": "What happens now?\nAfter you deliver the notice to the appropriate people and organizations, there may be some who have concerns about your application and submit a Notice of Dispute (P29). In this situation, you will not be able to get an estate grant. You may want to talk things through with the person who submitted the Notice of Dispute and see if they are willing to withdraw it. You can also apply to remove the Notice of Dispute if you believe the reason for the dispute is not valid."
            },
            {
               "type": "helptext",
               "name": "question450",
               "title": "[Moved here Nov 19 2020]\n<br>\nMight need to appear in multiple pages' exit panels depending if will or not will? \n<br>\nOld Sidebar FAQ What if I don't know all the assets in the deceased's estate?\n\nIt is your responsibility to make sure you find and report all the deceased's assets that you know about. If you successfully become the deceased's personal representative and you find more assets to report afterwards, there will be additional forms to complete. Use either form P14 or P15 to tell the court.\nhttps://www2.gov.bc.ca/gov/content/justice/courthouse-services/documents-forms-records/court-forms/probate-forms",
               "titleLocation": "hidden"
              },
            {
               "type": "panel",
               "name": "notifyExitPanel",
               "elements": [
                  {
                     "type": "infotext",
                     "name": "noticeNotRequiredExplanation",
                     "title": "Since you do not need to notify anyone, you can move on to the next step",
                     "titleLocation": "hidden",
                     "visible": false,
                     "visibleIf": "(!{noticeRequired})"
                  }
               ]
            }
         ],
         "title": "Print P1"
      }
   ],
   "showQuestionNumbers": "off",
   "requiredText": ""
}