{
  "affidavit": "An affidavit is a document that contains facts that you swear under oath or affirm to be true.",

  "applicant": "An applicant is someone doing the work to get a Representation Grant.\n\n More than one applicant can work together to get a Representation Grant.\n\n A Representation Grant is a court document that confirms you are the appropriate person to manage the property, money and belongings that a person left behind after they died.",

  "applicants": "An applicant is someone doing the work to get a Representation Grant.\n\n More than one applicant can work together to get a Representation Grant.\n\n A Representation Grant is a court document that confirms you are the appropriate person to manage the property, money and belongings that a person left behind after they died.",

  "application": "An application is the package of all the documents that you will need to file with the court to get a Representation Grant.\n\n This service will help you figure out which documents you will need.",

  "asset": "An asset can be any kind of belonging that a person owned, including property and money. The whole collection of these assets is called an estate.",

  "assets": "An asset can be any kind of belonging that a person owned, including property and money. The whole collection of these assets is called an estate.",
  
  "certificate of death": "Placeholder for the definition. Talk about information it provides such as date of death etc",

  "court certified copy": "A Court Certified Copy is a document that is stamped and sealed by the Court. It is not a regular photocopy.\n\n Some organizations will accept a regular photocopy while other organizations will only accept a Court Certified Copy.\n\n AA Court Certified Copy costs $40 each. You will need to ask the organizations if they will accept a regular photocopy.",

  "deceased": "The Deceased means the person who died.",

  "deceased's": "The Deceased means the person who died.",

  "estate":  "An estate is the collection of property, money and belongings that a person left behind after they died.",

  "estate grant":  "An Estate Grant is another name for a Representation Grant.\n\n A Representation Grant is a court document that confirms you are the appropriate person to manage the property, money and belongings that a person left behind after they died.",

  "family member": "A family member includes:\n - someone you are or were married to\n  - someone you live or lived with in a marriage-like relationship\n  - your child’s parent or legal guardian\n  - a relative of any of the people above who lives with them\n - a relative of yours who lives with you\n  - your own child",

  "family law protection order": "A Family Law Protection Order is a protection order from family court. It is a list of conditions set by a judge to protect one family member from another family member. This usually means no visits to your home or workplace, no phone calls, emails, or letters, and no messages through a friend or relative.\n\n  [Click here for more information](https://www2.gov.bc.ca/gov/content/life-events/divorce/family-justice/keeping-your-family-safe/protection-order)",

  "family violence": "When a family member makes you feel unsafe, this is called Family Violence. Family violence includes many things such as:\n - physical abuse (or attempted abuse)\n  - emotional or mental abuse (stalking, threats, intimidation or harassment)\n - sexual abuse (or attempted abuse)\n - denying food or other basic needs\n  - children being exposed to family violence\n\n  [Click here for more information for what counts as Family Violence](http://www.justice.gc.ca/eng/cj-jp/fv-vf/laws-lois.html).",

  "legal guardian": "A legal guardian is someone who was appointed by a court to be allowed to make decisions for a child under the age of 19.",

  "legal guardians": "A legal guardian is someone who was appointed by a court to be allowed to make decisions for a child under the age of 19.",

  "mentally competent": "Mentally Competent means an adult who is generally able to make everyday decisions about their finances and their legal situations.\n\n If you are not sure if this person will be able to understand their legal rights, then it is better to be safe and select 'No' for this question.\n\n An adult who is not mentally competent cannot make their own financial or legal decisions. They need another adult to make these decisions for them.",

  "other testamentary document": "An 'other testamentary document' is like a Will but is not complete under B.C. law. An 'other testamentary document' still explains how a person wants their property, money and belongings to be managed after they died; but it might be not be signed. For example:\n - unwitnessed Wills\n  - unfinished Wills (Google Docs notes)\n - email conversations\n - diary or journal entries\n - text messages\n  - notes on a napkin\n\n  Unwritten conversations (rumors or hearsay) do not count as 'other testamentary documents'.",

  "other testamentary documents": "An 'other testamentary document' is like a Will but is not complete under B.C. law. An 'other testamentary document' still explains how a person wants their property, money and belongings to be managed after they died; but it might be not be signed. For example:\n - unwitnessed Wills\n  - unfinished Wills (Google Docs notes)\n - email conversations\n - diary or journal entries\n - text messages\n  - notes on a napkin\n\n  Unwritten conversations (rumors or hearsay) do not count as 'other testamentary documents'.",

  "peace bond": "A peace bond is a protection order from criminal court. It is a list of conditions set by a judge to protect one person from another person. This usually means no visits to your home or workplace, no phone calls, emails, or letters, and no messages through a friend or relative.\n\n  [Click here for more information](https://www2.gov.bc.ca/gov/content/justice/criminal-justice/bcs-criminal-justice-system/if-you-are-convicted-of-a-crime/no-contact/peace-bond)",

  "personal representative": "A personal representative is someone who manages the property, money and belongings of a person who died.\n\n There can be more than one personal representative for a person who died.",

  "personal representatives": "A personal representative is someone who manages the property, money and belongings of a person who died.\n\n There can be more than one personal representative for a person who died.",

  "probate": "To Probate a Will means asking the Court to make sure that the Will is valid under B.C. law.\n\n A Grant of Probate is a type of Representation Grant specifically for executors named in the Will.\n\n A Representation Grant is a court document that confirms you are the appropriate person to manage the property, money and belongings that a person left behind after they died.",

  "probate fee": "The Probate Fee is part of the cost for confirming that you are the appropriate person to manage the belongings that a person left behind after they died.\n\n The Probate Fee will be less than 1.4% of the assets. There will be a Probate Fee calculator at the end of this service to tell you the total cost.\n\n [Click here for more information.](https://www.bclaws.gov.bc.ca/civix/document/id/complete/statreg/00_99004_01#section2) (This link opens in a new tab)",


 

 





  "protection order": "A Protection Order is a list of conditions set by a judge that a person must follow. This usually means no visits to your home or workplace, no phone calls, emails, or letters, and no messages through a friend or relative. If the person doesn't follow the conditions, they may face criminal charges.",

  "representation grant": "A Representation Grant is a court document that confirms you are the appropriate person to manage the property, money and belongings that a person left behind after they died.\n\n Representation Grant is an umbrella term that includes different types of grants.\n\n A Grant of Probate is a type of Representation Grant specifically for executors named in the Will.",

  "spouse": "A spouse is someone who was married to {deceasedName} and they did not get a divorce.\n\n A spouse is also someone who was living together, for at least two years, in a marriage-like relationship with {decreasedName} and that relationship still continued until {deceasedName} died. This type of relationship is also known as a common-law marriage.",

  "unsafe": "When a family member makes you feel unsafe, this is called Family Violence. Family violence includes many things such as:\n - physical abuse (or attempted abuse)\n  - emotional or mental abuse (stalking, threats, intimidation or harassment)\n - sexual abuse (or attempted abuse)\n - denying food or other basic needs\n  - children being exposed to family violence\n\n  [Click here for more information for what counts as Family Violence](http://www.justice.gc.ca/eng/cj-jp/fv-vf/laws-lois.html).",

  "will": "Generally, a Will is a legal document that explains how a person wants their property, money and belongings to be managed after they died.\n\n Sometimes a Will may include extra documents, like codicils or memorandums, that also count as part of the Will under B.C. law.",

  "wills": "Generally, a Will is a legal document that explains how a person wants their property, money and belongings to be managed after they died.\n\n Sometimes a Will may include extra documents, like codicils or memorandums, that also count as part of the Will under B.C. law.",

  "weapon": "A *weapon* means any thing used, designed to be used or intended for use\n\n  - (a) in causing death or injury to any person, or\n  - (b) for the purpose of threatening or intimidating any person\n  \n  and, without restricting the generality of the foregoing, includes a firearm and, for the purposes of sections 88, 267 and 272, any thing used, designed to be used or intended for use in binding or tying up a person against their will; (arme)\n  Click [here for more information](http://laws-lois.justice.gc.ca/eng/acts/C-46/page-1.html)."
}